{
  "header": {
    "experience": "Experiència",
    "projects": "Projectes",
    "skills": "Habilitats",
    "about": "Sobre mi",
    "contact": "Contacte"
  },
  "intro": {
    "name": "Que tal, sóc l'Eudald",
    "Dam": "Tècnic Superior en Desenvolupament d'Aplicacions Multiplataforma",
    "info": "de Barcelona, Espanya. Format en tecnologies tant de frontend com de backend, amb una especialització en el desenvolupament de pàgines web i aplicacions."
  },
  "download-cv": "Descarregar currículum",

  "experience": {
    "title": "Experiència Laboral",
    "practices": "Pràctiques 383h",
    "date": "Desembre 2023 - Maig 2024",
    "description": "Maquetació d'una pàgina web responsive utilitzant Next.js i Sass. ÚS de rutes per connectar l'aplicació a l'API del framework Guillotina, que gestionava la base de dades. A més, creació de components com formularis i taules amb Python per interactuar amb aquesta base de dades. Finalment, testatge del backend amb Python i el frontend utilitzant Cypress.",
    "web-page": "Pàgina Deltebre Dansa"
  },
  "projects": {
    "description1": "Aquest projecte tracta la gestió de tornejos utilitzant Next.js i Prisma per a la implementació del backend, amb l'autenticació d'usuaris manejada per Next-Auth. La plataforma permet als usuaris crear tornejos públics o privats, unir-se a ells i visualitzar-los. El creador del torneig pot gestionar els partits, puntuar-los i avançar fases fins a arribar a la final.",
    "description2": "Aquest projecte, realitzat per als alumnes i professorat del grau de Laboratori de l'Institut Castellet, gestiona l'inventari dels productes químics que aquests tenen guardats en armaris. Utilitzant React, Laravel i una base de dates SQLite facilita l'organització i el control de tots els químics guardats tenint un registre, per al professor (usuari admin), dels productes extrets, la quantitat i l'usuari que ho ha fet.",
    "description3": "Joc de mòbil amb Android Studio, utilitzant Kotlin i Firebase. Consisteix a seguir el patró de moviments o so fins a arribar el màxim de puntuació possible, si falles acaba la partida. Aquest consta de 3 nivells de dificultat, un perfil personalitzable incloent-hi imatges i un rànquing de puntuacions entre tots els jugadors.",
    "description4": "Aplicació de realitat virtual, fet amb Unity, que permet avaluar la pèrdua d'audició en joves, mostrant a través de diversos sons com la seva capacitat auditiva es deteriorarà amb el temps. Per implementar-ho, inicialment es realitzaria un càlcul per determinar la seva capacitat auditiva actual. L'usuari seria guiat a través d'un menú on se li demanaria ajustar, amb les seves pròpies mans, diversos paràmetres com l'edat, el volum al qual sol escoltar música i les hores diàries dedicades a aquesta activitat.",
    "description5": "Aquest projecte, fet majoritàriament amb PHP, permet desar codi al núvol. Consta d'un registre per a aquells que no tenen un compte, i un inici de sessió, si s'ha iniciat sessió, es podrà editar i crear els fitxers desitjats. També es podrà triar el fitxer o copiar i enganxar el codi a l'aplicació. (Aquest no està acabat a causa del temps demanat per al projecte)",
    "description6": "Projecte, fet amb Java, que simula un banc on es podrà ingressar i retirar diners del compte bancari de l'usuari. L'usuari haurà d'introduir l'ID del compte i la contrasenya i així poder entrar-hi. Com s'ha esmentat anteriorment, una vegada iniciada la sessió l'usuari podrà decidir si retirar diners o ingressar-los. Per això, haurà de seleccionar una de les dues opcions."
  },
  "improvement": "En millora",
  "finished": "Finalitzat",
  "show-more": "Mostrar més",
  "tools": "Eines i Tecnologies Addicionals",

  "about": {
    "paragraph1": "Em dic Eudald Daví Solà, més conegut com a Eudi o Euda. Soc un jove programador de vint anys amb una passió incessant per l'aprenentatge i un fort compromís amb el creixement personal i professional. La meva curiositat innata m'impulsa a buscar noves oportunitats per evolucionar en l'àmbit laboral, així com a contribuir amb les meves capacitats i coneixements en tot el que pugui ajudar.",
    "paragraph2": "Tot i que fa pocs anys que estic en el món de la programació, he adquirit una base sòlida i una gran passió per continuar creixent en aquest camp. Em motiva la capacitat de la tecnologia per transformar i millorar la nostra vida diària, i aspiro a contribuir activament a aquests avenços. Estic compromès amb l'aprenentatge constant i disposat a afrontar nous reptes per continuar simplificant i fent més gratificant la vida quotidiana a través de la informàtica.",
    "paragraph3": "Considero que el benestar físic i mental és essencial, i l'esport és una via efectiva per aconseguir aquests objectius. No només promou la salut física, sinó que també contribueix al benestar mental. Personalment, trobo plaer en practicar qualsevol esport i gaudir de la natura, com ara caminar per la muntanya, ja que crec que reforça tant la ment com el cos."
  },
  "footer" : "Quasi tots els drets reservats © 2024 | Eudald Daví Solà",
  "contact-me" : "Contacta'm",
  "your-name" : "El teu Nom",
  "enter-name" : "Introdueix el teu nom",
  "your-email" : "El teu Email",
  "enter-email" :"Introdueix el teu email",
  "message" : "Missatge",
  "your-message" : "El teu missatge",
  "send-message" : "Envia el Missatge"
}
